const state = {
  toplist: {
    toIdx: {
      id_3778678: '1',
      id_3779629: '0',
      id_2884035: '2',
      id_19723756: '3',
      id_10520166: '4',
      id_180106: '5',
      id_60198: '6',
      id_21845217: '7',
      id_11641012: '8',
      id_120001: '9',
      id_60131: '10',
      id_27135204: '19',
      id_112463: '20',
      id_3812895: '21',
      id_3001835560: '22',
      id_71385702: '22',
      id_991319590: '23',
      id_71384707: '24',
      id_1978921795: '25',
      id_2250011882: '26',
      id_2617766278: '27',
      id_745956260: '28',
      id_2023401535: '29',
      id_2006508653: '30',
      id_2809513713: '31',
      id_2809577409: '32',
    },
    detail: {
      featureRank: [],
      globalRank: [],
    },
    info: {},
  },
  nowPlay: { // 当前播放信息
    name: '',
    singer: [],
    id: '',
    picUrl: '',
    from: '', // 来自歌单/专辑
    mvId: '', // mv
  },
  playlist: [], // 播放列表
  isShowAboutSite: false, // 是否显示关于网站
}

export default state
